import React, { useState } from 'react'
import './Nav.css';
import '../../App.css';
import { Accordion, Modal, Offcanvas } from 'react-bootstrap';
import { Link, NavLink } from 'react-router-dom';
import Zakaz1 from '../Zakaz.js/Zakaz1';
import clothList from '../../clothes.json';
import { useDispatch, useSelector } from 'react-redux';
import { changeBreadcumb, changeCategory, changeMenu, proceedCart, proceedCart_button, removeAll } from '../../actions';

function Nav() {
    const count = useSelector(state => state.count);
    const [isRu, setRu] = useState(true);
    const [show, setShow] = useState(false);
    const [modal1, setModal1] = useState(false);
    const [modal2, setModal2] = useState(false);
    const [modal3, setModal3] = useState(false);
    const [modal4, setModal4] = useState(false);
    const handleClose = () => { setModal1(false) };
    const handleClose2 = () => { setModal2(false) };
    const handleClose3 = () => { setModal3(false) };
    const handleClose4 = () => { setModal4(false) };
    const handleClose5 = () => setShow(false);
    const handleShow5 = () => setShow(true);
    const handleShow = () => { setModal1(true) };


    const dispatch = useDispatch();
    const change_category = (key) => {
        dispatch(changeBreadcumb(key))
        if (clothList) {
            dispatch(changeCategory(clothList.filter(item => item.category === key)))
        }
    }
    const change_menu = (menu) => {
        dispatch(changeMenu(menu))
    } 

    var prevScrollpos = window.pageYOffset;
    window.onscroll = () => {
        var currentScrollPos = window.pageYOffset;
        if (prevScrollpos > currentScrollPos) {
            document.getElementById("navbar").style.top = "0";
        } else {
            document.getElementById("navbar").style.top = "-50px";
        }
        prevScrollpos = currentScrollPos;
    }
    return (
        <div className="nav_section" id="navbar">

            <div className="nav_section__container">
                <div className="nav_category__div">
                    <div className="nav_category">
                        <Accordion>
                            <Accordion.Item eventKey="0">
                                <Accordion.Header>ДЛЯ МУЖЧИН</Accordion.Header>
                                <Accordion.Body>
                                    <ul>
                                        <li onClick={() => { change_category("Рубашки"); change_menu("ДЛЯ МУЖЧИН") }}><NavLink className="nav_links__hover" to="/Рубашки">Рубашки</NavLink></li>
                                        <li onClick={() => { change_category("Свитшоты"); change_menu("ДЛЯ МУЖЧИН") }}><NavLink className="nav_links__hover" to="/Рубашки">Свитшоты</NavLink></li>
                                        <li onClick={() => { change_category("Джинсы"); change_menu("ДЛЯ МУЖЧИН") }}><NavLink className="nav_links__hover" to="/Рубашки">Джинсы</NavLink></li>
                                    </ul>
                                </Accordion.Body>
                            </Accordion.Item>
                            <Accordion.Item eventKey="1">
                                <Accordion.Header>ДЛЯ ЖЕНЩИН</Accordion.Header>
                                <Accordion.Body>
                                    <ul>
                                        <li onClick={() => { change_category("Платья"); change_menu("ДЛЯ ЖЕНЩИН") }}><NavLink className="nav_links__hover" to="/Рубашки">Платья</NavLink></li>
                                        <li onClick={() => { change_category("Хиджаб"); change_menu("ДЛЯ ЖЕНЩИН") }}><NavLink className="nav_links__hover" to="/Рубашки">Хиджаб</NavLink></li>
                                        <li onClick={() => { change_category("Комбинезоны"); change_menu("ДЛЯ ЖЕНЩИН") }}><NavLink className="nav_links__hover" to="/Рубашки">Комбинезоны </NavLink></li>
                                    </ul>
                                </Accordion.Body>
                            </Accordion.Item>
                            <Accordion.Item eventKey="2">
                                <Accordion.Header>ДЛЯ ДЕТЕЙ</Accordion.Header>
                                <Accordion.Body className="nav_child__body">
                                    <Accordion defaultActiveKey="0" >
                                        <Accordion.Item eventKey="0">
                                            <Accordion.Header>Для мальчиков</Accordion.Header>
                                            <Accordion.Body>
                                                <ul><li onClick={() => { change_category("Футболки"); change_menu("ДЛЯ ДЕТЕЙ") }}><NavLink className="nav_links__hover" to="/Рубашки">Футболки </NavLink></li></ul>
                                            </Accordion.Body>
                                        </Accordion.Item>
                                        <Accordion.Item eventKey="1">
                                            <Accordion.Header>Для девочек</Accordion.Header>
                                            <Accordion.Body>
                                                <ul><li onClick={() => { change_category("платья"); change_menu("ДЛЯ девочек") }}><NavLink className="nav_links__hover" to="/Рубашки">Платья </NavLink></li></ul>
                                            </Accordion.Body>
                                        </Accordion.Item>
                                    </Accordion>
                                </Accordion.Body>
                            </Accordion.Item>
                        </Accordion>
                    </div>
                </div>
                <div className="nav_right">
                    <div className="nav_logo__div">
                        <Link to="/">
                            {/* <span className="nav_svg1"> */}
                            <svg className="nav_svg1" width="190" height="39" viewBox="0 0 190 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clip-path="url(#clip0)">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M64.0787 9.37772H110.558V37.5711H64.0787V9.37772ZM85.9575 12.958H105.527L90.4996 32.3458H106.657V34.3576H67.977L82.9543 14.9589H67.9798V12.9772H85.9575V12.958ZM100.935 14.937H86.0156L72.5274 32.3458H87.5047L100.935 14.937ZM168.119 21.7144C168.067 22.0845 168.042 22.4577 168.044 22.8312C168.048 24.8143 168.645 26.7517 169.761 28.3983C170.876 30.045 172.459 31.3268 174.31 32.0816C176.161 32.8365 178.197 33.0304 180.159 32.6389C182.121 32.2474 183.922 31.2881 185.334 29.8823C185.671 29.5483 185.991 29.2007 186.298 28.8339L188.442 29.5839C187.98 30.2401 187.446 30.8441 186.851 31.385C185.719 32.537 184.367 33.4547 182.875 34.085C181.382 34.7153 179.778 35.0457 178.155 35.0568C176.533 35.068 174.924 34.7597 173.423 34.15C171.921 33.5403 170.557 32.6412 169.41 31.5049C168.262 30.3687 167.353 29.0179 166.736 27.5309C166.12 26.044 165.807 24.4505 165.817 22.843C165.827 21.2354 166.16 19.6459 166.795 18.1665C167.43 16.6872 168.355 15.3476 169.517 14.2254C171.816 11.9484 174.933 10.6693 178.184 10.6693C181.434 10.6693 184.552 11.9484 186.851 14.2254C187.861 15.1965 188.66 16.3615 189.199 17.6492C189.739 18.9369 190.008 20.3202 189.989 21.7144H168.119ZM168.503 19.6861H187.74C187.276 18.1968 186.45 16.8433 185.334 15.7445C184.393 14.8109 183.276 14.0703 182.046 13.565C180.817 13.0596 179.498 12.7995 178.167 12.7995C176.836 12.7995 175.517 13.0596 174.288 13.565C173.058 14.0703 171.941 14.8109 171 15.7445C169.875 16.8522 169.021 18.2005 168.503 19.6861ZM146.953 17.4963V34.3576H144.936V12.635H146.953V14.0392C148.767 12.2381 150.885 11.3376 153.307 11.3376C155.897 11.3376 158.006 12.1405 159.634 13.7463C161.262 15.3522 162.091 17.375 162.121 19.8148V34.3576H160.129V20.0146C160.143 19.1312 159.971 18.2547 159.622 17.4414C159.274 16.6282 158.757 15.8963 158.106 15.2929C156.835 14.0437 155.118 13.3405 153.328 13.3354C151.537 13.3302 149.817 14.0236 148.538 15.2655C147.873 15.9013 147.332 16.6529 146.942 17.4826L146.953 17.4963ZM128.378 12.7856C126.03 12.7748 123.751 13.5714 121.929 15.0395C120.107 16.5076 118.856 18.5563 118.389 20.8362C117.922 23.1161 118.267 25.486 119.366 27.5418C120.466 29.5976 122.251 31.2119 124.417 32.1095C126.583 33.007 128.997 33.1323 131.246 32.4638C133.495 31.7953 135.441 30.3745 136.751 28.4437C138.061 26.5128 138.654 24.1916 138.43 21.8758C138.205 19.56 137.177 17.3931 135.52 15.7445C134.597 14.7943 133.486 14.0416 132.258 13.5327C131.03 13.0238 129.709 12.7695 128.378 12.7856ZM128.378 10.6752C130.8 10.6773 133.167 11.3902 135.181 12.724C137.195 14.0578 138.764 15.9527 139.692 18.1695C140.619 20.3863 140.863 22.8256 140.393 25.1796C139.922 27.5336 138.758 29.6967 137.048 31.396C135.623 32.8066 133.87 33.8476 131.942 34.4266C130.015 35.0057 127.973 35.105 125.998 34.7157C124.022 34.3265 122.174 33.4607 120.617 32.1951C119.06 30.9294 117.842 29.3029 117.071 27.4596C116.3 25.6163 115.999 23.613 116.196 21.6272C116.392 19.6413 117.08 17.7341 118.198 16.0744C119.316 14.4147 120.83 13.0537 122.606 12.1119C124.381 11.1702 126.364 10.6767 128.378 10.6752ZM45.2168 12.7856C42.8658 12.7708 40.5825 13.5648 38.7566 15.032C36.9306 16.4992 35.6752 18.5488 35.2046 20.8309C34.7339 23.1129 35.0772 25.4861 36.1758 27.5454C37.2744 29.6047 39.0603 31.2224 41.2287 32.1225C43.3971 33.0226 45.8136 33.1493 48.0657 32.481C50.3179 31.8127 52.2662 30.3907 53.5781 28.4579C54.89 26.525 55.4842 24.201 55.2593 21.8824C55.0344 19.5639 54.0043 17.3945 52.3449 15.7445C51.4203 14.7928 50.3084 14.0392 49.0781 13.5303C47.8477 13.0213 46.5251 12.7679 45.1919 12.7856H45.2168ZM45.2168 10.6752C47.6384 10.6786 50.0047 11.3923 52.0174 12.7263C54.0301 14.0603 55.599 15.9549 56.5263 18.1712C57.4536 20.3874 57.6978 22.8261 57.228 25.1796C56.7582 27.5332 55.5955 29.6962 53.8866 31.396C52.4621 32.8066 50.7085 33.8476 48.7811 34.4266C46.8537 35.0057 44.8119 35.105 42.8365 34.7157C40.8611 34.3265 39.0131 33.4607 37.456 32.1951C35.8989 30.9294 34.6808 29.3029 33.9095 27.4596C33.1382 25.6163 32.8376 23.613 33.0342 21.6272C33.2309 19.6413 33.9187 17.7341 35.0368 16.0744C36.1549 14.4147 37.6688 13.0537 39.4444 12.1119C41.2201 11.1702 43.2027 10.6767 45.2168 10.6752ZM28.3635 5.1706V34.3385H26.3411V5.1706H28.3635ZM20.1275 29.1131L22.2438 29.8823C21.8492 30.4175 21.4112 30.9201 20.9343 31.385C19.7989 32.5161 18.4491 33.4137 16.9624 34.0262C15.4757 34.6387 13.8815 34.954 12.2714 34.954C10.6613 34.954 9.06707 34.6387 7.58038 34.0262C6.0937 33.4137 4.74388 32.5161 3.60853 31.385C1.89568 29.6888 0.72872 27.5276 0.255103 25.1746C-0.218515 22.8216 0.0224603 20.3822 0.947581 18.1648C1.8727 15.9474 3.44046 14.0514 5.45276 12.7164C7.46507 11.3814 9.83163 10.6673 12.2534 10.6642C13.8693 10.636 15.4738 10.9373 16.9672 11.5495C18.4605 12.1616 19.8109 13.0715 20.9343 14.2226C21.4112 14.6845 21.8492 15.1844 22.2438 15.7171L20.1275 16.4945C19.9148 16.2208 19.6772 15.9662 19.4202 15.6925C18.488 14.7499 17.3718 14.0053 16.1397 13.5042C14.9075 13.003 13.5852 12.7557 12.2534 12.7774C10.5876 12.7759 8.94715 13.1819 7.47767 13.9592C6.00819 14.7366 4.75512 15.8613 3.82966 17.2336C2.9042 18.6059 2.33497 20.1833 2.17248 21.8258C2.00999 23.4683 2.25927 25.1252 2.89819 26.6494C3.53712 28.1736 4.54593 29.5179 5.8351 30.5632C7.12428 31.6084 8.65395 32.3222 10.2884 32.6412C11.9228 32.9602 13.6115 32.8745 15.2044 32.3918C16.7974 31.9091 18.2455 31.0443 19.4202 29.8741C19.667 29.6323 19.9012 29.3783 20.122 29.1131H20.1275ZM77.4812 7.92973H97.1581C96.6191 6.82416 95.9035 5.81205 95.039 4.93247C94.0551 3.88202 92.8603 3.04712 91.5314 2.48144C90.2024 1.91575 88.7687 1.63179 87.3224 1.6478C84.3219 1.6478 81.747 2.76732 79.6058 4.93247C78.734 5.80856 78.0143 6.82128 77.4756 7.92973H77.4812ZM62.4431 7.92973H75.8041C76.4225 6.27829 77.4018 4.78274 78.6719 3.55017C80.9699 1.27676 84.0846 -0.000152588 87.332 -0.000152588C90.5795 -0.000152588 93.6942 1.27676 95.9921 3.55017C97.259 4.7832 98.2346 6.27885 98.8489 7.92973H112.204V39.0109H62.4292V7.92973H62.4431Z" fill="white" />
                                </g>
                                <defs>
                                    <clipPath id="clip0">
                                        <rect width="190" height="39" fill="white" />
                                    </clipPath>
                                </defs>
                            </svg>
                            {/* </span> */}
                        </Link>
                    </div>
                    <div className="nav_logo__icons">
                        <ul>
                            <li className="nav_search_maindiv">
                                <div className="nav_search__div">
                                    <input type="text" placeholder="Поиск" />
                                    <div className="nav_search__buttondiv">
                                        <span className="nav_svg2">
                                            <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M12.8829 11.9239L10.5864 9.63421C11.3274 8.69025 11.7294 7.52458 11.7279 6.32456C11.7279 5.25585 11.411 4.21114 10.8173 3.32253C10.2235 2.43393 9.3796 1.74135 8.39224 1.33237C7.40488 0.923392 6.31841 0.816385 5.27024 1.02488C4.22206 1.23338 3.25925 1.74801 2.50355 2.5037C1.74786 3.2594 1.23322 4.22221 1.02473 5.27039C0.816232 6.31857 0.92324 7.40503 1.33222 8.39239C1.7412 9.37976 2.43378 10.2237 3.32238 10.8174C4.21098 11.4112 5.2557 11.7281 6.32441 11.7281C7.52443 11.7296 8.6901 11.3275 9.63406 10.5866L11.9238 12.8831C11.9866 12.9464 12.0613 12.9966 12.1436 13.0309C12.2259 13.0652 12.3142 13.0829 12.4034 13.0829C12.4925 13.0829 12.5808 13.0652 12.6631 13.0309C12.7454 12.9966 12.8201 12.9464 12.8829 12.8831C12.9462 12.8203 12.9965 12.7456 13.0308 12.6633C13.0651 12.581 13.0827 12.4927 13.0827 12.4035C13.0827 12.3143 13.0651 12.2261 13.0308 12.1437C12.9965 12.0614 12.9462 11.9867 12.8829 11.9239ZM2.27178 6.32456C2.27178 5.52303 2.50946 4.73949 2.95477 4.07304C3.40008 3.40659 4.03301 2.88715 4.77353 2.58042C5.51406 2.27368 6.3289 2.19343 7.11504 2.3498C7.90117 2.50617 8.62328 2.89215 9.19005 3.45892C9.75682 4.02569 10.1428 4.7478 10.2992 5.53393C10.4555 6.32007 10.3753 7.13491 10.0686 7.87544C9.76182 8.61596 9.24238 9.24889 8.57593 9.6942C7.90948 10.1395 7.12594 10.3772 6.32441 10.3772C5.24958 10.3772 4.21878 9.95022 3.45877 9.1902C2.69875 8.43019 2.27178 7.39939 2.27178 6.32456Z" fill="#003466" />
                                            </svg>
                                        </span>
                                    </div>
                                </div>
                                <span className="nav_svg3">
                                    <svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M16.9842 15.6825L13.8675 12.575C14.8731 11.2939 15.4187 9.71194 15.4167 8.08334C15.4167 6.63294 14.9866 5.21512 14.1808 4.00915C13.375 2.80319 12.2297 1.86326 10.8897 1.30822C9.54969 0.753177 8.0752 0.607953 6.65267 0.890911C5.23015 1.17387 3.92347 1.8723 2.89789 2.89789C1.8723 3.92347 1.17387 5.23015 0.890911 6.65267C0.607953 8.0752 0.753177 9.54969 1.30822 10.8897C1.86326 12.2297 2.80319 13.375 4.00915 14.1808C5.21512 14.9866 6.63294 15.4167 8.08334 15.4167C9.71194 15.4187 11.2939 14.8731 12.575 13.8675L15.6825 16.9842C15.7677 17.0701 15.8691 17.1383 15.9808 17.1848C16.0925 17.2314 16.2123 17.2553 16.3333 17.2553C16.4543 17.2553 16.5742 17.2314 16.6859 17.1848C16.7976 17.1383 16.899 17.0701 16.9842 16.9842C17.0701 16.899 17.1383 16.7976 17.1848 16.6859C17.2314 16.5742 17.2553 16.4543 17.2553 16.3333C17.2553 16.2123 17.2314 16.0925 17.1848 15.9808C17.1383 15.8691 17.0701 15.7677 16.9842 15.6825ZM2.58334 8.08334C2.58334 6.99554 2.90591 5.93217 3.51025 5.0277C4.1146 4.12323 4.97358 3.41828 5.97858 3.002C6.98357 2.58572 8.08944 2.4768 9.15633 2.68902C10.2232 2.90124 11.2032 3.42506 11.9724 4.19425C12.7416 4.96344 13.2654 5.94344 13.4777 7.01034C13.6899 8.07724 13.581 9.1831 13.1647 10.1881C12.7484 11.1931 12.0434 12.0521 11.139 12.6564C10.2345 13.2608 9.17113 13.5833 8.08334 13.5833C6.62465 13.5833 5.2257 13.0039 4.19425 11.9724C3.1628 10.941 2.58334 9.54203 2.58334 8.08334Z" fill="white" />
                                    </svg>
                                </span>

                            </li>
                            <li onClick={() => setModal4(true)} className="nav_cart__div">
                                <span className="nav_svg4">
                                    <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M6.25 18.75C6.94036 18.75 7.5 18.1904 7.5 17.5C7.5 16.8096 6.94036 16.25 6.25 16.25C5.55964 16.25 5 16.8096 5 17.5C5 18.1904 5.55964 18.75 6.25 18.75Z" fill="white" />
                                        <path d="M15 18.75C15.6904 18.75 16.25 18.1904 16.25 17.5C16.25 16.8096 15.6904 16.25 15 16.25C14.3096 16.25 13.75 16.8096 13.75 17.5C13.75 18.1904 14.3096 18.75 15 18.75Z" fill="white" />
                                        <path d="M17.5 4.37501H3.6375L3.125 1.75001C3.09578 1.60671 3.01724 1.47819 2.90304 1.38683C2.78884 1.29548 2.64622 1.24706 2.5 1.25001H0V2.50001H1.9875L4.375 14.5C4.40422 14.6433 4.48276 14.7718 4.59696 14.8632C4.71116 14.9545 4.85378 15.003 5 15H15.625C15.9702 15 16.25 14.7202 16.25 14.375C16.25 14.0298 15.9702 13.75 15.625 13.75H5.5125L5 11.25H16.25C16.3945 11.2535 16.5357 11.2069 16.6497 11.118C16.7636 11.0291 16.8432 10.9035 16.875 10.7625L18.125 5.13751C18.1459 5.04477 18.1455 4.94848 18.1236 4.85596C18.1017 4.76344 18.059 4.67714 17.9987 4.60361C17.9385 4.53009 17.8622 4.47128 17.7758 4.43166C17.6894 4.39205 17.595 4.37267 17.5 4.37501ZM15.75 10H4.7625L3.8875 5.62501H16.7188L15.75 10Z" fill="white" />
                                    </svg>
                                </span>
                                <div className="nav_count__amount">
                                    {count}
                                </div>
                            </li>
                            <li className="nav_contact__li">
                                <span className="nav_svg5">
                                    <svg width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M18.3723 16.8734C17.9709 15.9191 17.3885 15.0523 16.6574 14.3212C15.9285 13.5881 15.0651 13.0035 14.1149 12.5999C14.1064 12.5956 14.0979 12.5935 14.0893 12.5892C15.4149 11.6281 16.2766 10.0627 16.2766 8.29648C16.2766 5.3706 13.9149 3 11 3C8.08513 3 5.72344 5.3706 5.72344 8.29648C5.72344 10.0627 6.58514 11.6281 7.91066 12.5913C7.90215 12.5956 7.89364 12.5977 7.88513 12.602C6.93194 13.0057 6.07663 13.5844 5.34259 14.3234C4.61219 15.055 4.02984 15.9216 3.62771 16.8755C3.23265 17.8093 3.01959 18.8105 3.00005 19.8249C2.99949 19.8477 3.00347 19.8703 3.01177 19.8916C3.02007 19.9128 3.03251 19.9321 3.04838 19.9485C3.06424 19.9648 3.0832 19.9777 3.10413 19.9866C3.12506 19.9955 3.14755 20 3.17026 20H4.44685C4.54047 20 4.61494 19.9253 4.61706 19.8334C4.65962 18.1847 5.31919 16.6406 6.48514 15.4702C7.69151 14.2593 9.29363 13.593 11 13.593C12.7064 13.593 14.3085 14.2593 15.5149 15.4702C16.6808 16.6406 17.3404 18.1847 17.3829 19.8334C17.3851 19.9274 17.4595 20 17.5531 20H18.8297C18.8524 20 18.8749 19.9955 18.8959 19.9866C18.9168 19.9777 18.9358 19.9648 18.9516 19.9485C18.9675 19.9321 18.9799 19.9128 18.9882 19.8916C18.9965 19.8703 19.0005 19.8477 18.9999 19.8249C18.9787 18.804 18.768 17.8109 18.3723 16.8734ZM11 11.9698C10.0234 11.9698 9.10427 11.5876 8.41278 10.8935C7.7213 10.1994 7.34045 9.27676 7.34045 8.29648C7.34045 7.31621 7.7213 6.39359 8.41278 5.6995C9.10427 5.0054 10.0234 4.62312 11 4.62312C11.9766 4.62312 12.8957 5.0054 13.5872 5.6995C14.2787 6.39359 14.6595 7.31621 14.6595 8.29648C14.6595 9.27676 14.2787 10.1994 13.5872 10.8935C12.8957 11.5876 11.9766 11.9698 11 11.9698Z" fill="white" />
                                    </svg>
                                </span>
                                <div className="nav_contact__div">
                                    <div className="nav_contact__space"></div>
                                    <div className="nav_contact__header">
                                        <span className="nav_svg6">
                                            <svg style={{ marginRight: "7px" }} width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M11 5.5C10.3201 5.5 9.65552 5.70161 9.09023 6.07932C8.52494 6.45704 8.08434 6.99391 7.82417 7.62203C7.56399 8.25015 7.49592 8.94131 7.62855 9.60812C7.76119 10.2749 8.08858 10.8874 8.56932 11.3682C9.05007 11.8489 9.66257 12.1763 10.3294 12.309C10.9962 12.4416 11.6874 12.3735 12.3155 12.1133C12.9436 11.8532 13.4805 11.4126 13.8582 10.8473C14.2359 10.282 14.4375 9.61737 14.4375 8.9375C14.4375 8.02582 14.0753 7.15148 13.4307 6.50682C12.786 5.86216 11.9117 5.5 11 5.5Z" fill="#565656" />
                                                <path d="M11 1.375C9.09636 1.375 7.23546 1.9395 5.65264 2.99711C4.06982 4.05471 2.83616 5.55793 2.10766 7.31667C1.37917 9.07541 1.18856 11.0107 1.55995 12.8777C1.93133 14.7448 2.84802 16.4598 4.1941 17.8059C5.54018 19.152 7.25519 20.0687 9.12226 20.4401C10.9893 20.8114 12.9246 20.6208 14.6833 19.8923C16.4421 19.1638 17.9453 17.9302 19.0029 16.3474C20.0605 14.7645 20.625 12.9036 20.625 11C20.6221 8.44818 19.6071 6.00172 17.8027 4.19731C15.9983 2.39291 13.5518 1.37791 11 1.375ZM16.4945 17.1366C16.4808 16.2349 16.1134 15.3746 15.4714 14.7411C14.8295 14.1076 13.9644 13.7517 13.0625 13.75H8.9375C8.03563 13.7517 7.17052 14.1076 6.52857 14.7411C5.88661 15.3746 5.51921 16.2349 5.5055 17.1366C4.25877 16.0234 3.37957 14.5577 2.98433 12.9337C2.58909 11.3097 2.69645 9.60392 3.29219 8.04228C3.88794 6.48063 4.94397 5.13677 6.32045 4.18864C7.69693 3.24051 9.32893 2.73283 11.0003 2.73283C12.6718 2.73283 14.3038 3.24051 15.6802 4.18864C17.0567 5.13677 18.1128 6.48063 18.7085 8.04228C19.3042 9.60392 19.4116 11.3097 19.0164 12.9337C18.6211 14.5577 17.7419 16.0234 16.4952 17.1366H16.4945Z" fill="#565656" />
                                            </svg>
                                        </span>
                                        +998-93-456-45-78
                                    </div>
                                    <div className="nav_contact__content">
                                        <ul>
                                            <li onClick={handleShow}>
                                                <NavLink to="/">
                                                    <svg style={{ marginRight: "7px" }} width="9" height="14" viewBox="0 0 9 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                        <path d="M1 1L7 7L1 13" stroke="#565656" stroke-width="2" />
                                                    </svg>
                                                    Профиль
                                                </NavLink>
                                            </li>
                                            <li>
                                                <NavLink to="/заказы">
                                                    <svg style={{ marginRight: "7px" }} width="9" height="14" viewBox="0 0 9 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                        <path d="M1 1L7 7L1 13" stroke="#565656" stroke-width="2" />
                                                    </svg>
                                                    Заказы
                                                </NavLink>
                                            </li>
                                            <li>
                                                <NavLink to="/">
                                                    <svg style={{ marginRight: "7px" }} width="9" height="14" viewBox="0 0 9 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                        <path d="M1 1L7 7L1 13" stroke="#565656" stroke-width="2" />
                                                    </svg>
                                                    Выйти
                                                </NavLink>
                                            </li>
                                        </ul>
                                    </div>
                                </div>
                            </li>
                        </ul>
                    </div>
                    <div className="nav_language">
                        {
                            isRu ?
                                <span className="nav_svg10">
                                    <svg onClick={() => setRu(true)} style={{ cursor: "pointer" }} width="26" height="19" viewBox="0 0 26 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <rect x="0.25" y="0.25" width="25.5" height="18.5" rx="1.75" fill="white" stroke="#F5F5F5" stroke-width="0.5" />
                                        <mask id="mask0" mask-type="alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="26" height="19">
                                            <rect x="0.25" y="0.25" width="25.5" height="18.5" rx="1.75" fill="white" stroke="white" stroke-width="0.5" />
                                        </mask>
                                        <g mask="url(#mask0)">
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M0 12.6666H26V6.33331H0V12.6666Z" fill="#0C47B7" />
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M0 19H26V12.6667H0V19Z" fill="#E53B35" />
                                        </g>
                                    </svg>
                                    <span className="nav_svg11">
                                        <svg style={{ marginLeft: "10px" }} width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M11 1L6 6L1 1" stroke="white" stroke-width="1.5" stroke-linejoin="round" />
                                        </svg>
                                    </span>
                                </span> :
                                <span className="nav_svg10">
                                    <svg onClick={() => setRu(false)} style={{ cursor: "pointer" }} width="26" height="19" viewBox="0 0 26 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <rect x="0.25" y="0.25" width="25.5" height="18.5" rx="1.75" fill="white" stroke="#F5F5F5" stroke-width="0.5" />
                                        <mask id="mask0" mask-type="alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="26" height="19">
                                            <rect x="0.25" y="0.25" width="25.5" height="18.5" rx="1.75" fill="white" stroke="white" stroke-width="0.5" />
                                        </mask>
                                        <g mask="url(#mask0)">
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M0 6.33333H26V0H0V6.33333Z" fill="#04AAC8" />
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M0 19H26V12.6667H0V19Z" fill="#23C840" />
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M4.33322 5.06666C4.71515 5.06666 5.07015 4.94871 5.36532 4.74647C5.3311 4.74878 5.29658 4.74996 5.26179 4.74996C4.40706 4.74996 3.71417 4.04107 3.71417 3.16662C3.71417 2.29217 4.40706 1.58329 5.26179 1.58329C5.29653 1.58329 5.33101 1.58446 5.36519 1.58677C5.07004 1.38458 4.71509 1.26666 4.33322 1.26666C3.30755 1.26666 2.47607 2.11732 2.47607 3.16666C2.47607 4.216 3.30755 5.06666 4.33322 5.06666ZM7.42843 4.43331C7.42843 4.78309 7.15127 5.06664 6.80938 5.06664C6.46749 5.06664 6.19034 4.78309 6.19034 4.43331C6.19034 4.08352 6.46749 3.79997 6.80938 3.79997C7.15127 3.79997 7.42843 4.08352 7.42843 4.43331ZM9.28562 2.53333C9.62751 2.53333 9.90466 2.24978 9.90466 1.9C9.90466 1.55022 9.62751 1.26666 9.28562 1.26666C8.94373 1.26666 8.66657 1.55022 8.66657 1.9C8.66657 2.24978 8.94373 2.53333 9.28562 2.53333ZM12.3809 1.9C12.3809 2.24978 12.1037 2.53333 11.7619 2.53333C11.42 2.53333 11.1428 2.24978 11.1428 1.9C11.1428 1.55022 11.42 1.26666 11.7619 1.26666C12.1037 1.26666 12.3809 1.55022 12.3809 1.9ZM11.7619 5.06664C12.1037 5.06664 12.3809 4.78309 12.3809 4.43331C12.3809 4.08352 12.1037 3.79997 11.7619 3.79997C11.42 3.79997 11.1428 4.08352 11.1428 4.43331C11.1428 4.78309 11.42 5.06664 11.7619 5.06664ZM9.90466 4.43331C9.90466 4.78309 9.62751 5.06664 9.28562 5.06664C8.94373 5.06664 8.66657 4.78309 8.66657 4.43331C8.66657 4.08352 8.94373 3.79997 9.28562 3.79997C9.62751 3.79997 9.90466 4.08352 9.90466 4.43331Z" fill="white" />
                                        </g>
                                    </svg>
                                    <span className="nav_svg11">
                                        <svg style={{ marginLeft: "10px" }} width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M11 1L6 6L1 1" stroke="white" stroke-width="1.5" stroke-linejoin="round" />
                                        </svg>
                                    </span>
                                </span>
                        }


                        <div className="nav_lang__div">
                            <div className="nav_lang_space"></div>
                            <div className="nav_lang__content">
                                {
                                    isRu ?
                                        <span className="nav_svg10">
                                            <svg onClick={() => setRu(false)} style={{ cursor: "pointer" }} width="26" height="19" viewBox="0 0 26 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <rect x="0.25" y="0.25" width="25.5" height="18.5" rx="1.75" fill="white" stroke="#F5F5F5" stroke-width="0.5" />
                                                <mask id="mask0" mask-type="alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="26" height="19">
                                                    <rect x="0.25" y="0.25" width="25.5" height="18.5" rx="1.75" fill="white" stroke="white" stroke-width="0.5" />
                                                </mask>
                                                <g mask="url(#mask0)">
                                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M0 6.33333H26V0H0V6.33333Z" fill="#04AAC8" />
                                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M0 19H26V12.6667H0V19Z" fill="#23C840" />
                                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M4.33322 5.06666C4.71515 5.06666 5.07015 4.94871 5.36532 4.74647C5.3311 4.74878 5.29658 4.74996 5.26179 4.74996C4.40706 4.74996 3.71417 4.04107 3.71417 3.16662C3.71417 2.29217 4.40706 1.58329 5.26179 1.58329C5.29653 1.58329 5.33101 1.58446 5.36519 1.58677C5.07004 1.38458 4.71509 1.26666 4.33322 1.26666C3.30755 1.26666 2.47607 2.11732 2.47607 3.16666C2.47607 4.216 3.30755 5.06666 4.33322 5.06666ZM7.42843 4.43331C7.42843 4.78309 7.15127 5.06664 6.80938 5.06664C6.46749 5.06664 6.19034 4.78309 6.19034 4.43331C6.19034 4.08352 6.46749 3.79997 6.80938 3.79997C7.15127 3.79997 7.42843 4.08352 7.42843 4.43331ZM9.28562 2.53333C9.62751 2.53333 9.90466 2.24978 9.90466 1.9C9.90466 1.55022 9.62751 1.26666 9.28562 1.26666C8.94373 1.26666 8.66657 1.55022 8.66657 1.9C8.66657 2.24978 8.94373 2.53333 9.28562 2.53333ZM12.3809 1.9C12.3809 2.24978 12.1037 2.53333 11.7619 2.53333C11.42 2.53333 11.1428 2.24978 11.1428 1.9C11.1428 1.55022 11.42 1.26666 11.7619 1.26666C12.1037 1.26666 12.3809 1.55022 12.3809 1.9ZM11.7619 5.06664C12.1037 5.06664 12.3809 4.78309 12.3809 4.43331C12.3809 4.08352 12.1037 3.79997 11.7619 3.79997C11.42 3.79997 11.1428 4.08352 11.1428 4.43331C11.1428 4.78309 11.42 5.06664 11.7619 5.06664ZM9.90466 4.43331C9.90466 4.78309 9.62751 5.06664 9.28562 5.06664C8.94373 5.06664 8.66657 4.78309 8.66657 4.43331C8.66657 4.08352 8.94373 3.79997 9.28562 3.79997C9.62751 3.79997 9.90466 4.08352 9.90466 4.43331Z" fill="white" />
                                                </g>
                                            </svg> </span> :
                                        <span className="nav_svg10">
                                            <svg onClick={() => setRu(true)} style={{ cursor: "pointer" }} width="26" height="19" viewBox="0 0 26 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <rect x="0.25" y="0.25" width="25.5" height="18.5" rx="1.75" fill="white" stroke="#F5F5F5" stroke-width="0.5" />
                                                <mask id="mask0" mask-type="alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="26" height="19">
                                                    <rect x="0.25" y="0.25" width="25.5" height="18.5" rx="1.75" fill="white" stroke="white" stroke-width="0.5" />
                                                </mask>
                                                <g mask="url(#mask0)">
                                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M0 12.6666H26V6.33331H0V12.6666Z" fill="#0C47B7" />
                                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M0 19H26V12.6667H0V19Z" fill="#E53B35" />
                                                </g>
                                            </svg>
                                        </span>
                                }
                            </div>
                        </div>



                    </div>
                    <div className="nav_burger__div">
                        <span className="nav_burger__svg">
                            <svg onClick={handleShow5} width="20" height="12" viewBox="0 0 20 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <rect width="20" height="2" rx="1" fill="white" />
                                <rect y="5" width="20" height="2" rx="1" fill="white" />
                                <rect y="10" width="20" height="2" rx="1" fill="white" />
                            </svg>
                        </span>

                    </div>
                </div>


                <Modal className="nav_little__modals" show={modal1} onHide={handleClose} centered>
                    <Modal.Body className="nav_modal1__body">
                        <svg onClick={() => setModal1(false)} style={{ cursor: "pointer", marginLeft: "auto", display: "block" }} width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M13.1251 0.875025C12.6419 0.391758 11.8584 0.391712 11.3751 0.874923L6.99938 5.25L2.62484 0.875076C2.14161 0.391797 1.35808 0.391798 0.874845 0.875078C0.391669 1.3583 0.391669 2.1417 0.874844 2.62492L5.24954 7L0.874846 11.3751C0.39167 11.8583 0.391669 12.6417 0.874845 13.1249C1.35808 13.6082 2.14161 13.6082 2.62484 13.1249L6.99938 8.75L11.3751 13.1251C11.8584 13.6083 12.6419 13.6082 13.1251 13.125C13.6083 12.6417 13.6083 11.8583 13.1251 11.375L8.75046 7L13.1251 2.62498C13.6083 2.14173 13.6083 1.35827 13.1251 0.875025Z" fill="#003466" />
                        </svg>

                        <input type="text" placeholder="Ваш номер" />
                        <input type="password" placeholder="Ваш пароль" />
                        <p></p>
                        <button>АВТОРИЗАЦИЯ</button>
                        <p>Забыли пароль?</p>
                        <button onClick={() => { setModal1(false); setModal2(true) }}>ПОЛУЧИТЬ СМС ДЛЯ ВХОДА</button>
                        <p>Нет аккаунта?</p>
                        <button onClick={() => { setModal1(false); setModal3(true) }}>РЕГИСТРАЦИЯ</button>
                    </Modal.Body>
                </Modal>

                <Modal className="nav_little__modals" show={modal2} onHide={handleClose2} centered>
                    <Modal.Body className="nav_modal1__body">
                        <svg onClick={() => setModal2(false)} style={{ cursor: "pointer", marginLeft: "auto", display: "block" }} width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M13.1251 0.875025C12.6419 0.391758 11.8584 0.391712 11.3751 0.874923L6.99938 5.25L2.62484 0.875076C2.14161 0.391797 1.35808 0.391798 0.874845 0.875078C0.391669 1.3583 0.391669 2.1417 0.874844 2.62492L5.24954 7L0.874846 11.3751C0.39167 11.8583 0.391669 12.6417 0.874845 13.1249C1.35808 13.6082 2.14161 13.6082 2.62484 13.1249L6.99938 8.75L11.3751 13.1251C11.8584 13.6083 12.6419 13.6082 13.1251 13.125C13.6083 12.6417 13.6083 11.8583 13.1251 11.375L8.75046 7L13.1251 2.62498C13.6083 2.14173 13.6083 1.35827 13.1251 0.875025Z" fill="#003466" />
                        </svg>

                        <input type="text" placeholder="Ваш имя" />
                        <input type="password" placeholder="Ваш номер" />
                        <p></p>
                        <button >РЕГИСТРАЦИЯ ЧЕРЕЗ СМС-КОД</button>
                        <p> </p>
                        <button>РЕГИСТРАЦИЯ С ПАРОЛЕМ</button>
                    </Modal.Body>
                </Modal>

                <Modal className="nav_little__modals" show={modal3} onHide={handleClose3} centered>
                    <Modal.Body className="nav_modal1__body">
                        <svg onClick={() => setModal3(false)} style={{ cursor: "pointer", marginLeft: "auto", display: "block" }} width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M13.1251 0.875025C12.6419 0.391758 11.8584 0.391712 11.3751 0.874923L6.99938 5.25L2.62484 0.875076C2.14161 0.391797 1.35808 0.391798 0.874845 0.875078C0.391669 1.3583 0.391669 2.1417 0.874844 2.62492L5.24954 7L0.874846 11.3751C0.39167 11.8583 0.391669 12.6417 0.874845 13.1249C1.35808 13.6082 2.14161 13.6082 2.62484 13.1249L6.99938 8.75L11.3751 13.1251C11.8584 13.6083 12.6419 13.6082 13.1251 13.125C13.6083 12.6417 13.6083 11.8583 13.1251 11.375L8.75046 7L13.1251 2.62498C13.6083 2.14173 13.6083 1.35827 13.1251 0.875025Z" fill="#003466" />
                        </svg>

                        <input type="text" placeholder="Ваш имя" />
                        <input type="password" placeholder="Ваш номер" />
                        <input type="password" placeholder="Ваш пароль" />
                        <p></p>
                        <button>РЕГИСТРАЦИЯ С ПАРОЛЕМ</button>
                    </Modal.Body>
                </Modal>

                <Modal
                    scrollable={true}
                    size="xl"
                    aria-labelledby="contained-modal-title-vcenter"
                    centered
                    show={modal4}
                    onHide={handleClose4}
                    className="nav_main__card"
                >
                    <p className="nav_main__card__p">
                        ТОВАР ДОБАВЛЕН В КОРЗИНУ
                        <svg onClick={() => setModal4(false)} style={{ cursor: "pointer", position: "absolute", top: "33px", right: "33px" }} width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M13.1251 0.875025C12.6419 0.391758 11.8584 0.391712 11.3751 0.874923L6.99938 5.25L2.62484 0.875076C2.14161 0.391797 1.35808 0.391798 0.874845 0.875078C0.391669 1.3583 0.391669 2.1417 0.874844 2.62492L5.24954 7L0.874846 11.3751C0.39167 11.8583 0.391669 12.6417 0.874845 13.1249C1.35808 13.6082 2.14161 13.6082 2.62484 13.1249L6.99938 8.75L11.3751 13.1251C11.8584 13.6083 12.6419 13.6082 13.1251 13.125C13.6083 12.6417 13.6083 11.8583 13.1251 11.375L8.75046 7L13.1251 2.62498C13.6083 2.14173 13.6083 1.35827 13.1251 0.875025Z" fill="#003466" />
                        </svg>
                    </p>
                    <Zakaz1 />
                    <div className="nav_card__line"></div>
                    <div className="nav_card__buttons">
                        <button onClick={() => setModal4(false)} className="nav_oform__button"><Link to="/Оформление">ОФОРМИТЬ ЗАКАЗ</Link></button>
                        <button onClick={() => { setModal4(false); dispatch(proceedCart()); dispatch(proceedCart_button()); dispatch(removeAll()) }} className="nav_card__clear">CLEAR</button>
                    </div>
                </Modal>

                <Offcanvas show={show} onHide={handleClose5} placement={'end'}>
                    <Offcanvas.Body>
                        <div className="nav_search__div">
                            <input type="text" placeholder="Поиск" />
                            <div className="nav_search__buttondiv">
                                <span className="nav_svg2">
                                    <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M12.8829 11.9239L10.5864 9.63421C11.3274 8.69025 11.7294 7.52458 11.7279 6.32456C11.7279 5.25585 11.411 4.21114 10.8173 3.32253C10.2235 2.43393 9.3796 1.74135 8.39224 1.33237C7.40488 0.923392 6.31841 0.816385 5.27024 1.02488C4.22206 1.23338 3.25925 1.74801 2.50355 2.5037C1.74786 3.2594 1.23322 4.22221 1.02473 5.27039C0.816232 6.31857 0.92324 7.40503 1.33222 8.39239C1.7412 9.37976 2.43378 10.2237 3.32238 10.8174C4.21098 11.4112 5.2557 11.7281 6.32441 11.7281C7.52443 11.7296 8.6901 11.3275 9.63406 10.5866L11.9238 12.8831C11.9866 12.9464 12.0613 12.9966 12.1436 13.0309C12.2259 13.0652 12.3142 13.0829 12.4034 13.0829C12.4925 13.0829 12.5808 13.0652 12.6631 13.0309C12.7454 12.9966 12.8201 12.9464 12.8829 12.8831C12.9462 12.8203 12.9965 12.7456 13.0308 12.6633C13.0651 12.581 13.0827 12.4927 13.0827 12.4035C13.0827 12.3143 13.0651 12.2261 13.0308 12.1437C12.9965 12.0614 12.9462 11.9867 12.8829 11.9239ZM2.27178 6.32456C2.27178 5.52303 2.50946 4.73949 2.95477 4.07304C3.40008 3.40659 4.03301 2.88715 4.77353 2.58042C5.51406 2.27368 6.3289 2.19343 7.11504 2.3498C7.90117 2.50617 8.62328 2.89215 9.19005 3.45892C9.75682 4.02569 10.1428 4.7478 10.2992 5.53393C10.4555 6.32007 10.3753 7.13491 10.0686 7.87544C9.76182 8.61596 9.24238 9.24889 8.57593 9.6942C7.90948 10.1395 7.12594 10.3772 6.32441 10.3772C5.24958 10.3772 4.21878 9.95022 3.45877 9.1902C2.69875 8.43019 2.27178 7.39939 2.27178 6.32456Z" fill="#003466" />
                                    </svg>
                                </span>
                            </div>
                        </div>
                        <div className="filter_acardion">
                            <Accordion defaultActiveKey="0" flush>
                                <Accordion.Item eventKey="0">
                                    <Accordion.Header>Для мужшин</Accordion.Header>
                                    <Accordion.Body>
                                        <ul>
                                            <li onClick={() => { handleClose5(); change_category("Рубашки"); change_menu("ДЛЯ МУЖЧИН") }}><NavLink className="nav_links__hover" to="/Рубашки">Рубашки</NavLink></li>
                                            <li onClick={() => { handleClose5(); change_category("Свитшоты"); change_menu("ДЛЯ МУЖЧИН") }}><NavLink className="nav_links__hover" to="/Рубашки">Свитшоты</NavLink></li>
                                            <li onClick={() => { handleClose5(); change_category("Джинсы"); change_menu("ДЛЯ МУЖЧИН") }}><NavLink className="nav_links__hover" to="/Рубашки">Джинсы</NavLink></li>
                                        </ul>
                                    </Accordion.Body>
                                </Accordion.Item>
                                <Accordion.Item eventKey="1">
                                    <Accordion.Header>Для женшин</Accordion.Header>
                                    <Accordion.Body>
                                        <ul>
                                            <li onClick={() => { handleClose5(); change_category("Платья"); change_menu("ДЛЯ ЖЕНЩИН") }}><NavLink className="nav_links__hover" to="/Рубашки">Платья</NavLink></li>
                                            <li onClick={() => { handleClose5(); change_category("Хиджаб"); change_menu("ДЛЯ ЖЕНЩИН") }}><NavLink className="nav_links__hover" to="/Рубашки">Хиджаб</NavLink></li>
                                            <li onClick={() => { handleClose5(); change_category("Комбинезоны"); change_menu("ДЛЯ ЖЕНЩИН") }}><NavLink className="nav_links__hover" to="/Рубашки">Комбинезоны </NavLink></li>
                                        </ul>
                                    </Accordion.Body>
                                </Accordion.Item>
                                <Accordion.Item eventKey="2">
                                    <Accordion.Header>Для детей</Accordion.Header>
                                    <Accordion.Body>
                                        <Accordion>
                                            <Accordion.Item eventKey="0">
                                                <Accordion.Header>Для мальчиков</Accordion.Header>
                                                <Accordion.Body>
                                                    <ul><li onClick={() => { handleClose5(); change_category("Футболки"); change_menu("ДЛЯ ДЕТЕЙ") }}><NavLink className="nav_links__hover" to="/Рубашки">Футболки </NavLink></li></ul>
                                                </Accordion.Body>
                                            </Accordion.Item>
                                            <Accordion.Item eventKey="1">
                                                <Accordion.Header>Для девочек</Accordion.Header>
                                                <Accordion.Body>
                                                    <ul><li onClick={() => { handleClose5(); change_category("платья"); change_menu("ДЛЯ девочек") }}><NavLink className="nav_links__hover" to="/Рубашки">Платья </NavLink></li></ul>
                                                </Accordion.Body>
                                            </Accordion.Item>
                                        </Accordion>
                                    </Accordion.Body>
                                </Accordion.Item>
                            </Accordion>
                        </div>


                    </Offcanvas.Body>
                </Offcanvas>
            </div>
        </div>
    )
}

export default Nav
